{
  "overview": {
    "name": "Connor McKelvey",
    "title": "Senior Software Engineer",
    "email": "connormckelvey@gmail.com",
    "location": {
      "city": "Boulder",
      "region": "CO"
    },
    "links": [
      {
        "name": "LinkedIn",
        "href": "https://linkedin.com/in/connorfinn",
        "text": "linkedin.com/in/connorfinn"
      },
      {
        "name": "Github",
        "href": "https://github.com/connormckelvey",
        "text": "github.com/connormckelvey"
      }
    ],
    "summary": "An experienced full-stack Software Engineer with a 10-year background in Cloud architecture, distributed systems, and web development. Specializes in orchestrating software projects and crafting complex systems across a broad spectrum of technologies, with a keen emphasis on elevating developer experience and tooling efficiency. Brings exceptional mentorship skills, a dedication to innovation, and a commitment to continuous improvement within dynamic environments."
  },
  "work": [
    {
      "name": "Staff Engineer 1",
      "company": "VMware Carbon Black",
      "dates": {
        "start": "2019-04-15T00:00:00.000Z",
        "end": "2024-04-26T00:00:00.000Z"
      },
      "location": {
        "city": "Boulder",
        "region": "CO"
      },
      "remote": true,
      "summary": "As a Staff Engineer and the Team Architect at VMware CarbonBlack, I have played a pivotal role in the design and development of critical security solutions, driving technical leadership, and mentoring a growing team across multiple geographies. My contributions have spanned across architectural design, implementation, and the mentorship of engineering teams, significantly impacting the company's product offerings and engineering practices.",
      "keywords": [
        "Golang",
        "Python",
        "Java",
        "Bash",
        "Protobuf",
        "gRPC",
        "AWS (Kinesis, EKS, S3, DynamoDB, Aurora Postgres)",
        "Terraform",
        "Helm",
        "ArgoCD",
        "Kubernetes"
      ],
      "highlights": [
        "Elevated junior engineers' proficiency in Go, AWS, Kubernetes, via pair programming and workshops, enhancing the team's delivery of reliable software.",
        "Accelerated onboarding of 8 engineers with pair programming and architecture overviews, leading to significant new feature deliveries and a distributed on-call model.",
        "Developed and contributed a lease-based load-balancing solution in Golang for an open-source stream processing library, reducing latency spikes by 83%.",
        "Implemented a scalable event filtering solution in Go, Python, and Java, boosting filtration capabilities and enabling a 30% cost savings for customer data storage and processing.",
        "Architected and developed a schema versioning system for streaming data in Go, enabling customizable updates and lifecycle management while eliminating 10,000+ lines of code.",
        "Developed a Flink utility in Java enabling arbitrary data extraction from protobuf messages without full deserialization, cutting processing time in half.",
        "Created configuration validation, development, and issue identification tooling in Python and Go for a self-service public API Gateway, reducing MTTD from 1 hour to 5 minutes.",
        "Developed a data processing pipeline with Docker, Go, Python, and Jupyter to identify and report unused observability metrics, reducing operational costs and platform issues."
      ]
    },
    {
      "name": "Software Engineer III",
      "company": "Workday",
      "dates": {
        "start": "2018-11-01T00:00:00.000Z",
        "end": "2019-04-15T00:00:00.000Z"
      },
      "location": {
        "city": "Boulder",
        "region": "CO"
      },
      "summary": "At Workday, within the People Experience team, I contributed as a Fullstack Engineer to the development of a new employee homepage, focusing on seamless integrations with legacy systems and enhancing development practices.",
      "keywords": [
        "Node",
        "Kotlin",
        "Java",
        "TypeScript",
        "React",
        "GraphQL",
        "Protobuf",
        "XML"
      ],
      "highlights": [
        "Successfully integrated a modern React application with an existing MVP shell, enhancing accessibility and avoiding code duplication.",
        "Created Typescript tooling for type-safe configuration loaders, reducing boilerplate across multiple environments and test suites.",
        "Streamlined development and testing setup by automating reservation, bootstrapping, and local tunneling for ephemeral development environments.",
        "Led Scrum ceremonies and mentored team members in Node.JS, Typescript, gRPC, and software engineering best practices, enhancing team efficiency and skill set."
      ]
    },
    {
      "name": "Software Engineer",
      "company": "CA Technologies",
      "location": {
        "city": "Boulder",
        "region": "CO"
      },
      "dates": {
        "start": "2016-05-01T00:00:00.000Z",
        "end": "2018-11-01T00:00:00.000Z"
      },
      "summary": "At CA Technologies, I held a multifaceted role, contributing as a Software Engineer to various projects, including a BI Data Pipeline and a Task Management Product, while also driving improvements in developer experience and technical mentoring.",
      "keywords": [
        "JavaScript",
        "Golang",
        "Clojure",
        "Kafka",
        "Avro",
        "S3",
        "React"
      ],
      "highlights": [
        "Conducted technical workshops and managed onboarding for three teams, improving associate engineers' skills and productivity, and promoting a culture of collaboration.",
        "Developed an Event Gateway service with OpenResty and Lua, facilitating efficient edge-based authentication and lightweight data transformations.",
        "Minimized Docker image vulnerabilities through the establishment of a base image library and the implementation of a scheduled building and vulnerability scanning pipeline.",
        "Implemented a backup and restore solution for Grafana dashboards, transitioning to Infrastructure as Code, enhancing data loss prevention and improving observability for monitoring and incident response.",
        "Implemented a sandboxing functionality in React, TypeScript, and Node.js for secure browser rendering of untrusted HTML, enhancing threat mitigation."
      ]
    },
    {
      "name": "Web Developer",
      "company": "Findsome &amp; Winmore",
      "location": {
        "city": "Orlando",
        "region": "FL"
      },
      "dates": {
        "start": "2014-06-01T00:00:00.000Z",
        "end": "2016-05-01T00:00:00.000Z"
      },
      "summary": "As a Web Developer at Findsome & Winmore, I played a crucial role in the development and delivery of marketing websites and web applications, driving project estimations, and implementing technical solutions that significantly enhanced client engagement and operational efficiency.",
      "keywords": [
        "HTML",
        "CSS",
        "JavaScript",
        "Angular",
        "PHP",
        "WordPress",
        "Ruby"
      ],
      "highlights": [
        "Collaborated with development and leadership to plan, estimate, and execute web development projects, ensuring alignment with client objectives, budget, and deadlines.",
        "Directed the architecture and development of business solutions using Node.js, Angular, and Ruby on Rails, encompassing faceted search, interactive maps, and bespoke web applications.",
        "Implemented automated marketing analytics and web traffic reports, providing clients with valuable insights for decision-making.",
        "Established a physical device lab for concurrent QA testing, improving the quality and compatibility of web solutions across devices."
      ],
      "achievements": []
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "category": "Technical Skills",
      "keywords": [
        "Go",
        "JavaScript",
        "TypeScript",
        "Python",
        "Java"
      ]
    },
    {
      "name": "Frameworks and Technologies",
      "category": "Technical Skills",
      "keywords": [
        "Cloudflare Workers",
        "Kubernetes",
        "Docker",
        "AWS Kinesis",
        "Kafka",
        "Flink",
        "Jupyter",
        "OpenResty",
        "Node.js",
        "Angular",
        "React",
        "Prometheus",
        "Grafana"
      ]
    },
    {
      "name": "Databases and Stores",
      "category": "Technical Skills",
      "keywords": [
        "Postgres",
        "SQLite",
        "AWS DynamoDB",
        "AWS S3",
        "BadgerDB",
        "Cloudflare KV",
        "ElasticSearch"
      ]
    },
    {
      "name": "Software Development",
      "category": "Technical Skills",
      "keywords": [
        "API design",
        "Secure software development",
        "software architecture",
        "distributed systems",
        "event-driven applications",
        "web standards",
        "test automation",
        "code generation"
      ]
    },
    {
      "name": "Infrastructure, Security, and DevOps",
      "category": "Technical Skills",
      "keywords": [
        "Workload orchestration",
        "infrastructure as code",
        "CI/CD",
        "observability and monitoring",
        "incident management",
        "vulnerability auditing",
        "threat modeling"
      ]
    },
    {
      "name": "Collaboration and Mentorship",
      "category": "Leadership and Project Management",
      "keywords": [
        "Elevates team proficiency through pair programming and workshops; accelerates onboarding of new team members."
      ]
    },
    {
      "name": "Project Delivery",
      "category": "Leadership and Project Management",
      "keywords": [
        "Leads projects from inception to delivery, ensuring they meet strategic objectives and performance goals."
      ]
    },
    {
      "name": "Strategic Planning",
      "category": "Leadership and Project Management",
      "keywords": [
        "Collaborates with development teams, product, and leadership to align software solutions with business objectives."
      ]
    },
    {
      "name": "Communication",
      "category": "Soft Skills",
      "keywords": [
        "Effective in presenting complex technical information to both technical and non-technical stakeholders."
      ]
    },
    {
      "name": "Problem-Solving",
      "category": "Soft Skills",
      "keywords": [
        "Alplies first principles thinking and strong analytical skills to deconstruct and understand the fundamental elements of complex technical challenges."
      ]
    },
    {
      "name": "Adaptability",
      "category": "Soft Skills",
      "keywords": [
        "Quickly learns and adapts to new technologies and changing technical landscapes."
      ]
    }
  ],
  "projects": [
    {
      "name": "Chillweather",
      "description": "90s-themed 24/7 YouTube live stream with up-to-date weather forecasts, precipitation maps, and weather alerts for 12 US cities Built with Go, Typescript, AWS.",
      "links": [
        {
          "name": "chillweather",
          "href": "https://www.youtube.com/@chillweather2439/streams",
          "text": "Chillweather"
        }
      ]
    },
    {
      "name": "Résumé",
      "description": "Markdown syntax and renderer extensions to support compiling JSON and Markdown template files into HTML, Docx, and PDF Résumé documents for release. Built with Golang.",
      "links": [
        {
          "name": "resume",
          "href": "https://github.com/connormckelvey/resume",
          "text": "Résumé"
        }
      ]
    },
    {
      "name": "Tmplrun",
      "description": "Templating engine library and command line tool that ditches the DSL for JavaScript and other languages. Written in Golang.",
      "links": [
        {
          "name": "tmplrun",
          "href": "https://github.com/connormckelvey/tmplrun?tab=readme-ov-file#tmplrun",
          "text": "Tmplrun"
        }
      ]
    },
    {
      "name": "Dottie",
      "description": "Constraint-based appointment scheduling and planning tool for the behavioral health industry. Built with Python, OR Tools, Node.JS, Typescript React/Remix, Postgres"
    }
  ],
  "education": [
    {
      "name": "B.A. Sociology",
      "institution": "University of Central Florida",
      "location": {
        "city": "Orlando",
        "region": "FL"
      },
      "dates": {
        "start": "2010-08-01T00:00:00.000Z",
        "end": "2013-12-01T00:00:00.000Z"
      },
      "highlights": [
        "Minor in Cultural Anthropology, Certificate in Women's Studies",
        "Active in Amnesty International and Knight's Advocates",
        "Volunteered with UCF Victims Services and Harbor House of Central Florida"
      ]
    }
  ],
  "interests": []
}